#include<stdio.h>
int main()
{
	double I,w=0;
	int condition;
	printf("利润<=100000 输入:1\n100000<利润<=200000 输入:2\n200000<利润<=400000 输入:3\n400000<利润<=600000 输入:4\n600000<利润<=1000000输入:5\n利润>=1000000输入:6\n");
	scanf("%d",&condition);
	printf("利润=");
	scanf("%lf",&I);
	switch(condition){
		case 1:w=I*0.1;break;
		case 2:w=100000*0.1+(I-100000)*0.075;break;
		case 3:w=100000*0.1+100000*0.075+(I-200000)*0.05;break;
		case 4:w=100000*0.1+100000*0.075+200000*0.05+(I-400000)*0.03;break;
		case 5:w=100000*0.1+100000*0.075+200000*0.05+200000*0.03+(I-600000)*0.015;break;
		case 6:w=100000*0.1+100000*0.075+200000*0.05+200000*0.03+400000*0.015+(I-1000000)*0.01;break;
	}
	printf("应发奖金总数:%lf\n",w);
	return 0
}
		